src/boundaryConditions/dynContactAngleModel/dynamicAlphaContactAngleRobinBC/growingDroplet3D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    front
    {
        type            wall;
        inGroups        1(wall);
        nFaces          5000;
        startFace       1480000;
    }
    back
    {
        type            patch;
        nFaces          5000;
        startFace       1485000;
    }
    left
    {
        type            patch;
        nFaces          5000;
        startFace       1490000;
    }
    right
    {
        type            patch;
        nFaces          5000;
        startFace       1495000;
    }
    top
    {
        type            patch;
        nFaces          10000;
        startFace       1500000;
    }
    inlet
    {
        type            patch;
        nFaces          16;
        startFace       1510000;
    }
    bottomRemainder
    {
        type            patch;
        nFaces          9984;
        startFace       1510016;
    }
)

// ************************************************************************* //
